Revit 2026 API

# StructuralAssetPoissonRatio Property

---

The Poisson ratio of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ PoissonRatio { get; set; }
```
```vb
Public Property PoissonRatio As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ PoissonRatio {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member PoissonRatio : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |
| InapplicableDataException | When setting this property: the material type is wood. -or- When setting this property: the behavior is isotropic. |

This property cannot be used to set the Poisson ratio for wood-based and isotropic materials. For such assets, use setPoissonRatio instead.

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace